feaser/openblt/Target/Demo/ARMCM0_XMC1_XMC1400_Boot_Kit_Keil/Prog/lib/xmclib/inc/xmc_posif_map.h
#if (UC_DEVICE == XMC1402) && (UC_PACKAGE == VQFN64)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P1_8     	0
#define POSIF1_IN0_P4_1     	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P1_7     	0
#define POSIF1_IN1_P4_2     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P1_6     	0
#define POSIF1_IN2_P4_3     	1
#define POSIF1_IN2_VADC_G1BFL2	2
#endif


#if (UC_DEVICE == XMC1402) && (UC_PACKAGE == TSSOP38)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#endif

#if (UC_DEVICE == XMC1404) && (UC_PACKAGE == LQFP64)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P1_8     	0
#define POSIF1_IN0_P4_1     	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P1_7     	0
#define POSIF1_IN1_P4_2     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P1_6     	0
#define POSIF1_IN2_P4_3     	1
#define POSIF1_IN2_VADC_G1BFL2	2
#endif

#if (UC_DEVICE == XMC1404) && (UC_PACKAGE == VQFN40)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#endif

#if (UC_DEVICE == XMC1404) && (UC_PACKAGE == VQFN48)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P1_6     	0
#define POSIF1_IN2_VADC_G1BFL2	2
#endif


#if (UC_DEVICE == XMC1404) && (UC_PACKAGE == VQFN64)
#define POSIF0_IN0_ERU0_PDOUT0	3
#define POSIF0_IN0_P0_13    	1
#define POSIF0_IN0_P1_2     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU0_PDOUT1	3
#define POSIF0_IN1_P0_14    	1
#define POSIF0_IN1_P1_1     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU0_PDOUT2	3
#define POSIF0_IN2_P0_15    	1
#define POSIF0_IN2_P1_0     	0
#define POSIF0_IN2_VADC_G1BFL2	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P1_8     	0
#define POSIF1_IN0_P4_1     	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P1_7     	0
#define POSIF1_IN1_P4_2     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P1_6     	0
#define POSIF1_IN2_P4_3     	1
#define POSIF1_IN2_VADC_G1BFL2	2
#endif

#if (UC_DEVICE == XMC4100) && (UC_PACKAGE == LQFP64)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4100) && (UC_PACKAGE == VQFN48)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4104) && (UC_PACKAGE == LQFP64)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4104) && (UC_PACKAGE == VQFN48)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4108) && (UC_PACKAGE == LQFP64)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4108) && (UC_PACKAGE == VQFN48)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4200) && (UC_PACKAGE == LQFP64)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


#if (UC_DEVICE == XMC4200) && (UC_PACKAGE == VQFN48)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#endif


