feaser/openblt/Target/Demo/ARMCM0_XMC1_XMC1400_Boot_Kit_Keil/Prog/lib/xmclib/inc/xmc_posif_map.h
#if (UC_DEVICE == XMC4504) && (UC_PACKAGE == LQFP100)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4504) && (UC_PACKAGE == LQFP144)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_P3_10    	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_P3_9     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_P3_8     	1
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4700) && (UC_PACKAGE == BGA196)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_P3_10    	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_P3_9     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_P3_8     	1
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4700) && (UC_PACKAGE == LQFP100)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4700) && (UC_PACKAGE == LQFP144)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF0_HSD_CCU40_ST0    0
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_P3_10    	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_P3_9     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_P3_8     	1
#define POSIF1_IN2_VADC_C0SR1	2
#define POSIF0_HSD_CCU41_ST0    0
#endif


#if (UC_DEVICE == XMC4800) && (UC_PACKAGE == BGA196)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_P3_10    	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_P3_9     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_P3_8     	1
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4800) && (UC_PACKAGE == LQFP100)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_VADC_C0SR1	2
#endif


#if (UC_DEVICE == XMC4800) && (UC_PACKAGE == LQFP144)
#define POSIF0_IN0_ERU1_PDOUT0	3
#define POSIF0_IN0_P14_7    	1
#define POSIF0_IN0_P1_3     	0
#define POSIF0_IN0_VADC_G1BFL0	2
#define POSIF0_IN1_ERU1_PDOUT1	3
#define POSIF0_IN1_P14_6    	1
#define POSIF0_IN1_P1_2     	0
#define POSIF0_IN1_VADC_G1BFL1	2
#define POSIF0_IN2_ERU1_PDOUT2	3
#define POSIF0_IN2_P14_5    	1
#define POSIF0_IN2_P1_1     	0
#define POSIF0_IN2_VADC_C0SR0	2
#define POSIF1_IN0_ERU1_PDOUT0	3
#define POSIF1_IN0_P2_5     	0
#define POSIF1_IN0_P3_10    	1
#define POSIF1_IN0_VADC_G1BFL0	2
#define POSIF1_IN1_ERU1_PDOUT1	3
#define POSIF1_IN1_P2_4     	0
#define POSIF1_IN1_P3_9     	1
#define POSIF1_IN1_VADC_G1BFL1	2
#define POSIF1_IN2_ERU1_PDOUT2	3
#define POSIF1_IN2_P2_3     	0
#define POSIF1_IN2_P3_8     	1
#define POSIF1_IN2_VADC_C0SR1	2
#endif

#endif /* XMC_POSIF_MAP_H */
